RTP/src/Documents/УдалениеПользователя/УдалениеПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УдалениеПользователя</name>
  <attributes>
    <name>ЛогинПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

RTP/src/Enums/ТипыПользователей/ТипыПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПользователей</name>
  <enumValues>
    <name>Тестировщик</name>
  </enumValues>
  <enumValues>
    <name>УдаленныйТестировщик</name>
  </enumValues>
  <enumValues>
    <name>Заказчик</name>
  </enumValues>
  <enumValues>
    <name>Менеджер</name>
  </enumValues>
</mdclass:Enum>

RTP/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>ФамилияИмяОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПользователя</name>
    <type>
      <types>EnumRef.ТипыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

RTP/src/Catalogs/Тестировщики/Тестировщики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Тестировщики</name>
  <attributes>
    <name>ФамилияИмяОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

RTP/src/Catalogs/УдаленныеТестировщики/УдаленныеТестировщики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УдаленныеТестировщики</name>
  <attributes>
    <name>ФамилияИмяОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Квалификация</name>
    <type>
      <types>EnumRef.КвалификацииУдаленныхТестировщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

RTP/src/Catalogs/Заказчики/Заказчики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заказчики</name>
  <attributes>
    <name>ФамилияИмяОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказы</name>
    <type>
      <types>CatalogRef.Заказы</types>
    </type>
  </attributes>
</mdclass:Catalog>

RTP/src/Catalogs/Менеджеры/Менеджеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Менеджеры</name>
  <attributes>
    <name>ФамилияИмяОтчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
</mdclass:Catalog>

RTP/src/Documents/УдалениеПользователя/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Логин = Объект.ЛогинПользователя;
	
	Если Логин = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	СообщениеОбУдалении = Новый СообщениеПользователю();
	
	Если УдалитьПользователя(Логин) тогда
		СообщениеОбУдалении.Текст = "Пользователь " + Логин + " успешно удален";
	Иначе
		СообщениеОбУдалении.Текст = "Пользователь " + Логин + " не найден";
	КонецЕсли;
	
	СообщениеОбУдалении.Сообщить();		
КонецПроцедуры

&НаСервере
Функция ПолучитьПользователя(Логин)
	Пользователь = Неопределено;
	
	Если Логин = Неопределено Тогда
		Сообщить("Логин не определен");
	Иначе		
		ЗапросПользователя = Новый Запрос;
		ЗапросПользователя.Текст = "ВЫБРАТЬ
					   |Пользователи.УникальныйИдентификатор,
					   |Пользователи.Ссылка,
					   |Пользователи.ФамилияИмяОтчество,
					   |Пользователи.ТипПользователя,
					   |Пользователи.Логин
					   |ИЗ Справочник.Пользователи КАК Пользователи";
		Результат = ЗапросПользователя.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Логин = Логин Тогда
				Запись = Выборка.Ссылка.ПолучитьОбъект();
				Пользователь = Запись;
				Сообщить(Выборка.ФамилияИмяОтчество + " получен!");
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Пользователь;
КонецФункции


&НаСервере
Функция УдалитьПользователя(Логин)
	Пользователь = ПолучитьПользователя(Логин);
	Если Пользователь = Неопределено Тогда
		Сообщить("Пользователь не найден");
		Возврат Ложь;
	Иначе
		УдалитьСвязанныеЗаписи(Пользователь.УникальныйИдентификатор, Пользователь.ТипПользователя);
		Пользователь.Удалить();
		Сообщить("Пользователь удален");
		Возврат Истина;		
	КонецЕсли;	
КонецФункции

&НаСервере
Процедура УдалитьСвязанныеЗаписи(УИдентификатор, ТипПользователя)
	Запрос = Новый Запрос;
	
	Если ТипПользователя = Перечисления.ТипыПользователей.Тестировщик Тогда
		Запрос.Текст = "ВЫБРАТЬ
					   |Тестировщики.Пользователь,
					   |Тестировщики.Ссылка,
					   |Тестировщики.ФамилияИмяОтчество
					   |ИЗ Справочник.Тестировщики КАК Тестировщики";
	ИначеЕсли ТипПользователя = Перечисления.ТипыПользователей.УдаленныйТестировщик Тогда
		Запрос.Текст = "ВЫБРАТЬ
					   |УдаленныеТестировщики.Пользователь,
					   |УдаленныеТестировщики.Ссылка,
					   |УдаленныеТестировщики.ФамилияИмяОтчество
					   |ИЗ Справочник.УдаленныеТестировщики КАК УдаленныеТестировщики";
	ИначеЕсли ТипПользователя = Перечисления.ТипыПользователей.Заказчик Тогда
		Запрос.Текст = "ВЫБРАТЬ
					   |Заказчики.Пользователь,
					   |Заказчики.Ссылка,
					   |Заказчики.ФамилияИмяОтчество
					   |ИЗ Справочник.Заказчики КАК Заказчики";
	ИначеЕсли ТипПользователя = Перечисления.ТипыПользователей.Менеджер Тогда
		Запрос.Текст = "ВЫБРАТЬ
					   |Менеджеры.Пользователь,
					   |Менеджеры.Ссылка,
					   |Менеджеры.ФамилияИмяОтчество
					   |ИЗ Справочник.Менеджеры КАК Менеджеры";
	КонецЕсли;
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Пользователь = УИдентификатор Тогда
			Запись = Выборка.Ссылка.ПолучитьОбъект();
			Запись.Удалить();
			Сообщить(Выборка.ФамилияИмяОтчество + " удален!");
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
